IvanPerletti/Stm32_TCP/Gmm_Driver_Src/TEth.cpp
/******************************************************************************
 *
 *  \brief		Serial Port Class
 *  \details	This class is used to configure and use the Serial ports on
 *  STM32F4 board
 *  \author	Ivan Perletti - General Medical Merate- GMM.spa - Seriate - ITALY
 *  \version	1.1a
 *  \date		January 15th, 2014
 *  \pre		Enable interrupt routine for each USART declared and used. Ex:
 * void USART3_IRQHandler(void) { usart3.Interrupt_Handler(&usart3); }
 * and add extern TSerial usart3; in the top .c file
 *  \bug		Not all memory is freed when deleting an object of this class.
 *  \warning	Improper use can crash your application
 *  \copyright GMM.spa - All Rights Reserved
 *
 ******************************************************************************/

#include "TEth.h"
extern "C"{
	#include <string.h>
	#include "stm32f4xx_rcc.h"
	#include "stm32f4xx_gpio.h"
	#include "stm32f4x7_eth.h"
	#include "lwip/mem.h"
	#include "lwip/memp.h"
	#include "lwip/tcp.h"
	#include "lwip/tcp_impl.h"
	#include "lwip/udp.h"
	#include "netif/etharp.h"
	#include "ethernetif.h"
}

extern void ETHLAN8720_RxCallback(u8_t *payload, u16_t len);

//----Private Struct-----------------------------------------------------------

ETH_InitTypeDef TEth::ETH_InitStructure;
__IO uint32_t TEth::EthStatus;
__IO uint8_t TEth::EthLinkStatus;

struct netif TEth::gnetif;
ip_addr_t TEth::ip_local;
ip_addr_t TEth::netmask;
ip_addr_t TEth::gateway;
ip_addr_t TEth::ip_server;

struct client *TEth::esTx;
struct tcp_pcb *TEth::pcbTx;

extern "C" {
	void Delay(int ms)
	{
		ms = 0;
	}
}

err_t tcp_client_recv(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err);
void tcp_client_err(void *arg, err_t err);
void tcp_client_connection_close(struct tcp_pcb *tpcb, struct client * es);
err_t tcp_client_poll(void *arg, struct tcp_pcb *tpcb);
err_t tcp_client_sent(void *arg, struct tcp_pcb *tpcb, u16_t len);
void tcp_client_send(struct tcp_pcb *tpcb, struct client * es);
err_t tcp_client_connected(void *arg, struct tcp_pcb *tpcb, err_t err);

void ETH_link_callback(struct netif *netif)
{
	__IO uint32_t timeout = 0;
	uint32_t tmpreg;
	uint16_t RegValue;

  if(netif_is_link_up(netif))
  {
    /* Restart the auto-negotiation */
    if(TEth::ETH_InitStructure.ETH_AutoNegotiation != ETH_AutoNegotiation_Disable)
    {
      /* Reset Timeout counter */
      timeout = 0;

      /* Enable auto-negotiation */
      ETH_WritePHYRegister(ETH_PHY_ADDRESS, PHY_BCR, PHY_AutoNegotiation);

      /* Wait until the auto-negotiation will be completed */
      do
      {
        timeout++;
      } while (!(ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_BSR) & PHY_AutoNego_Complete) && (timeout < (uint32_t)PHY_READ_TO));  

      /* Reset Timeout counter */
      timeout = 0;

      /* Read the result of the auto-negotiation */
      RegValue = ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_SR);

      /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
			/* Mask out bits which are not for speed and link indication, bits 4:2 are used */
			RegValue = (RegValue >> 2) & 0x07;

			/* Switch statement */
			switch (RegValue) {
				case 1: /* Base 10, half-duplex */
					TEth::ETH_InitStructure.ETH_Speed = ETH_Speed_10M;
					TEth::ETH_InitStructure.ETH_Mode = ETH_Mode_HalfDuplex;
					break;
				case 2: /* Base 100, half-duplex */
					TEth::ETH_InitStructure.ETH_Speed = ETH_Speed_100M;
					TEth::ETH_InitStructure.ETH_Mode = ETH_Mode_HalfDuplex;
					break;
				case 5: /* Base 10, full-duplex */
					TEth::ETH_InitStructure.ETH_Speed = ETH_Speed_10M;
					TEth::ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;
					break;
				case 6: /* Base 100, full-duplex */
					TEth::ETH_InitStructure.ETH_Speed = ETH_Speed_100M;
					TEth::ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;
					break;
				default:
					break;
			}

      /*------------------------ ETHERNET MACCR Re-Configuration --------------------*/
      /* Get the ETHERNET MACCR value */  
      tmpreg = ETH->MACCR;

      /* Set the FES bit according to ETH_Speed value */ 
      /* Set the DM bit according to ETH_Mode value */ 
      tmpreg |= (uint32_t)(TEth::ETH_InitStructure.ETH_Speed | TEth::ETH_InitStructure.ETH_Mode);

      /* Write to ETHERNET MACCR */
      ETH->MACCR = (uint32_t)tmpreg;

      //_eth_delay_(ETH_REG_WRITE_DELAY);
      tmpreg = ETH->MACCR;
      ETH->MACCR = tmpreg;
    }

    /* Restart MAC interface */
    ETH_Start();

    netif_set_addr(&TEth::gnetif, &TEth::ip_local , &TEth::netmask, &TEth::gateway);
    
    /* When the netif is fully configured this function must be called.*/
    netif_set_up(&TEth::gnetif);    

		TEth::EthLinkStatus = 0;
  }
  else
  {
    ETH_Stop();
    /*  When the netif link is down this function must be called.*/
    netif_set_down(&TEth::gnetif);
  }
}

/* Handle the incoming TCP Data */

void tcp_client_handle (struct tcp_pcb *tpcb, struct client *es)
{
	TEth::esTx = es;
	TEth::pcbTx = tpcb;
}

void tcp_client_err(void *arg, err_t err)
{
  struct client *es;

  if (err != ERR_OK)
	{
    LWIP_ASSERT("arg != NULL",arg != NULL);

    es = (struct client *)arg;
    es->state = ES_NOT_CONNECTED;
	}
}

/**
  * @brief tcp_receiv callback
  * @param arg: argument to be passed to receive callback 
  * @param tpcb: tcp connection control block 
  * @param err: receive error code 
  * @retval err_t: retuned error  
  */
err_t tcp_client_recv(void *arg, struct tcp_pcb *tpcb, struct pbuf *p, err_t err)
{ 
  struct client *es;
  err_t ret_err;
  

  LWIP_ASSERT("arg != NULL",arg != NULL);
  
  es = (struct client *)arg;
  
  /* if we receive an empty tcp frame from server => close connection */
  if (p == NULL)
  {
    /* remote host closed connection */
    es->state = ES_CLOSING;
    if(es->p_tx == NULL)
    {
       /* we're done sending, close connection */
       tcp_client_connection_close(tpcb, es);
    }
    else
    {    
      /* send remaining data*/
      tcp_client_send(tpcb, es);
    }
    ret_err = ERR_OK;
  }   
  /* else : a non empty frame was received from echo server but for some reason err != ERR_OK */
  else if(err != ERR_OK)
  {
    /* free received pbuf*/
    if (p != NULL)
    {
      es->p_tx = NULL;
      pbuf_free(p);
    }

    ret_err = err;
  }
  else if(es->state == ES_CONNECTED)
  {
    /* Acknowledge data reception */
    tcp_recved(tpcb, p->tot_len);  

		if (p->tot_len) {
			struct pbuf *pBuf = p;
		
			do {
				ETHLAN8720_RxCallback((u8_t *)pBuf->payload, pBuf->len);
				pBuf = pBuf->next;
			} while (pBuf != NULL);
		}
		
    /* handle the received data */
    tcp_client_handle(tpcb, es);
    
