IvanPerletti/Stm32_TCP/Gmm_Driver_Src/TEth.cpp
  /* Get Ethernet link status*/
  if(ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_BSR) & 0x4)
  {
    EthStatus |= ETH_LINK_FLAG;
  }

	return(0x00);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Configure the Nested Vectored Interrupt Controller (NVIC)
 * @retval Error number - see USART_Init
 */
unsigned char TEth::NVIC_StructConfig(void)
{
	return(0x00);
}

//-----------------------------------------------------------------------------------------
//##################################################			PUBLIC FUNCTIONS
//-----------------------------------------------------------------------------------------
/**
 * @brief ETH Full Initialization
 * @retval Error code bits:
			- &=0x01 - invalid number: there is no such a USART configuration;
			- &=0x02 - RCC System Clocks Configuration error
			- &=0x04 - GPIO Configuration error
			- &=0x08 - ETH_Struct Configuration error
			- &=0x10 - Nested VEctor Interrupt Routine error
 */
char TEth::setup_HW(void)
{
	char error = 0x00;

  /* Reset ETHERNET on AHB Bus */
  ETH_DeInit();
	
	error |= RCC_Configuration();/*!< System Clocks Configuration */
	error |= GPIO_Config();/*!< GPIO Configuration */
	error |= ETH_StructConfig();/*!< stpIndex configuration */
	error |= NVIC_StructConfig();/*!< Nested VEctor Interrupt Routine*/

	return (error);
}

//-----------------------------------------------------------------------------------------
/**
 * @brief Open the chosed port
 * @return Error code (see TEth::setup_HW(void) )
 * @pre USE TEth::setupCOM() before calling open() function: otherwise default setup is loaded
 * @remark  do not use other ASSERT for USART_InitStructure: parameters can be 0x00
 */
int TEth::open(void)
{
	int error = 0;

	error = setup_HW();

	if (error == 0) {
		/* Initializes the dynamic memory heap defined by MEM_SIZE.*/
		mem_init();

		/* Initializes the memory pools defined by MEMP_NUM_x.*/
		memp_init();
		
		/* - netif_add(struct netif *netif, struct ip_addr *ipaddr,
		struct ip_addr *netmask, struct ip_addr *gw,
		void *state, err_t (* init)(struct netif *netif),
		err_t (* input)(struct pbuf *p, struct netif *netif))

		Adds your network interface to the netif_list. Allocate a struct
		netif and pass a pointer to this structure as the first argument.
		Give pointers to cleared ip_addr structures when using DHCP,
		or fill them with sane numbers otherwise. The state pointer may be NULL.

		The init function pointer must point to a initialization function for
		your ethernet netif interface. The following code illustrates it's use.*/
		netif_add(&gnetif, &ip_local, &netmask, &gateway, NULL, &ethernetif_init, &ethernet_input);

		/*  Registers the default network interface.*/
		netif_set_default(&gnetif);

		if (EthStatus == (ETH_INIT_FLAG | ETH_LINK_FLAG))
		{ 
			/* Set Ethernet link flag */
			gnetif.flags |= NETIF_FLAG_LINK_UP;

			/* When the netif is fully configured this function must be called.*/
			netif_set_up(&gnetif);
		}
		else
		{
			/*  When the netif link is down this function must be called.*/
			netif_set_down(&gnetif);
		}
		
		/* Set the link callback function, this function is called on change of link status*/
		netif_set_link_callback(&gnetif, ETH_link_callback);
	
		/* create new tcp pcb */
		client_pcb = tcp_new();
		
		if (client_pcb != NULL)
			/* connect to destination address/port */
			error = tcp_connect(client_pcb, &ip_server , DEST_PORT, tcp_client_connected);
		else
			error = ERR_MEM;
	}
		
	return(error);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Check if the port is open
 * @return port status:
 				- 0x00 if port is closed
  				- 0x01 if port is open
 */
char TEth::isOpen (void)
{
	if (esTx)
		return (esTx->state == ES_CONNECTED);
	return(0x00);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Close the port without de-initializing it. All the RX / TX memory will be erased
 */
void TEth::close (void)
{

}

void TEth::poll(uint32_t localTime)
{

	static uint8_t status = 0;
	uint32_t t = (ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_BSR) & 0x4);
	
	/* If we have link and previous check was not yet */
	if (t && !status) {
		/* Set link up */
		netif_set_link_up(&gnetif);
		
		status = 1;
	}	
	/* If we don't have link and it was on previous check */
	if (!t && status) {
		EthLinkStatus = 1;
		/* Set link down */
		netif_set_link_down(&gnetif);
			
		status = 0;
	}
	
	/* check if any packet received */
	if (ETH_CheckFrameReceived())
	{ 
		/* process received ethernet packet */
		ethernetif_input(&gnetif);
	}
    /* handle periodic timers for LwIP */
#if LWIP_TCP
  /* TCP periodic process every 250 ms */
  if (localTime - TCPTimer >= TCP_TMR_INTERVAL)
  {
    TCPTimer =  localTime;
    tcp_tmr();
  }
#endif

  /* ARP periodic process every 5s */
  if ((localTime - ARPTimer) >= ARP_TMR_INTERVAL)
  {
    ARPTimer =  localTime;
    etharp_tmr();
  }
}

//-----------------------------------------------------------------------------------------
/**
 * @brief Transmit a string of characters via the USART specified in stpIndex.
 * @param stpIndex	Can be any of the USART# ( USART1, USART2 etc. )
 * @param *s		is the string you want to send
 *
 * @note The string has to be passed to the function as a pointer because
 *		the compiler doesn't know the 'string' data type. In standard
 *		C a string is just an array of characters
 *
 * @note At the moment it takes a volatile char because the received_string variable
 * declared as volatile char --> otherwise the compiler will spit out warnings
 * */
void TEth::puts(const char *s)
{
	strncpy((char*)dataTx, (const char *)s, strlen(s));
	dataTx[sizeof(dataTx) - 1] = '\0';

	/* allocate pbuf */
	esTx->p_tx = pbuf_alloc(PBUF_TRANSPORT, strlen((char*)dataTx) , PBUF_POOL);
 
	if (esTx->p_tx)
	{       
		/* copy data to pbuf */
		pbuf_take(esTx->p_tx, (char*)dataTx, strlen((char*)dataTx));

