IvanPerletti/Stm32_TCP/Gmm_Driver_Src/TEth.cpp
		/* send data */
		tcp_client_send(esTx->pcb, esTx);
	}	
}

//-----------------------------------------------------------------------------------------
/**
 * @brief Wipe the input buffer data replacing the first numChar elements with
 *  "-" character. No way to know the real dimension of the buffer: you risk to
 *  modify the memory next to the buffer if numChar is greater than the real
 *  buffer dimension
 * @param *buffer 		ptr to the array to wipe
 * @param numChar		num of char to replace [use sizeof(buffer) / sizeof(char]]
 */
void TEth::cleanBuffer(volatile char *buffer, const unsigned short int numChar)
{
	unsigned int bb;
	for(bb=0; bb<numChar; bb++)
		buffer[bb]='-';
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Wipe the private bCircArrRx data replacing elements with "*" char
 */
void TEth::cleanBuffer(void)
{
	unsigned int bb;
	//	USART_ITConfig(USARTPORT, USART_IT_TXE, DISABLE);
	for(bb=0; bb<RXBUFFERSIZE; bb++){
		bCircArrRx[bb]='(';
		bCircArrTx[bb]='(';
	}
	tx_tail=0;
	tx_head=0;
	rx_tail=0;
	rx_head=0;
	//	USART_ITConfig(USARTPORT, USART_IT_TXE, ENABLE);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Read eventual Usart new message: new message is the right circular
 * sub-buffer between rx_head and rx_tail head ptrs
 * @param msgRx		buffer into which copy new received data read from circular buffer
 * @retval number of read char
 * - if > 0 is the number of char,
 * - (-1) error, RX Cable seems unplugged
 * @note While reading interrupt is allowed to modify RX_CircBuff
 * warranty for no critical in this time
 * @note Avoided to pause RX interrupt for incomplete message coming
 */
int TEth::read(volatile char *msgRx)
{
	int qq=0;

//#ifdef _USB_DEBUG_
//	tDbg.write((char*)"READ rx_head ");
//	tDbg.write((char*)"%d  ", rx_head);
//	tDbg.write((char*)"READ rx_tail ");
//	tDbg.write((char*)"%d  ", rx_tail);
//#endif

	if(rx_head!=rx_tail)
	{ //  new data to read on USART
		while( rx_head!=rx_tail)
		{
			msgRx[qq]=bCircArrRx[rx_head];// if interrupt happens here NO PROBLEM
			rx_head++;// if interrupt happens here will be %RXBUFFERSIZE
			rx_head%=RXBUFFERSIZE;
			qq++;
			qq%=RXBUFFERSIZE;
		}
	}
	return(qq);//number of char it reads
}

//-----------------------------------------------------------------------------------------
/**
 * @brief Check if there is anything to read from Receiving buffer
 * @return the number of character to be read
 */
int TEth::bytesAvailable(void)
{
	int notAlreadyReadChar = rx_tail - rx_head;
	if(notAlreadyReadChar<0)
		notAlreadyReadChar+=RXBUFFERSIZE;
	return(notAlreadyReadChar);
}
//-----------------------------------------------------------------------------------------
/**
 * @brief Check if there is anything to be transmitted on the serial port
 * @return number of characters to be read
 */
int TEth::bytesToWrite(void)
{
	int notAlreadyWrittenChar = tx_tail - tx_head;
	if(notAlreadyWrittenChar<0)
		notAlreadyWrittenChar+=RXBUFFERSIZE;
	return(notAlreadyWrittenChar);
}
//-----------------------------------------------------------------------------------------
/**
 * @param msg 		ptr to the message array you want to transmit
 * @param charNum2Send  ptr to the number of char to effectively transmit
 * @return error
				- |=0x01 - message completely sent
				- &=0x01 - Port Not correctly initialized
				- &=0x02 - Too much character to send: stay < RXBUFFERSIZE
 */
unsigned char TEth::write(const char *msg, unsigned short int charNum2Send)
{
	memcpy((void *)dataTx, (void *)msg, charNum2Send);

	/* allocate pbuf */
	esTx->p_tx = pbuf_alloc(PBUF_TRANSPORT, charNum2Send , PBUF_POOL);
 
	if (esTx->p_tx)
	{       
		/* copy data to pbuf */
		pbuf_take(esTx->p_tx, (char*)dataTx, charNum2Send);

		/* send data */
		tcp_client_send(esTx->pcb, esTx);
	}	
}

//-----------------------------------------------------------------------------------------
/**
 * @brief append a msg onto circual array. Instead of TEth::write() this
 * function does not ENABLE Interrupt USART_IT_TXE
 * @param msg	ptr to the message array you want to transmit
 * @param charNum2Send	ptr to the number of char to effectively transmit
 * @return error
				- |=0x01 - message completely sent
				- &=0x01 - Port Not correctly initialized
				- &=0x02 - Too much character to send: stay < RXBUFFERSIZE
 */
unsigned char TEth::append(const char *msg,
		unsigned short int charNum2Send)
{
	unsigned short int  qq=0;
	int delta;

	if (charNum2Send<=RXBUFFERSIZE)
	{
	}
	return (0x02);// Too much character to send: stay < RXBUFFERSIZE
}

